espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_host_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** SDIO_SLC_HOST_FUNC2_0_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_FUNC2_0_REG (DR_REG_HOST_BASE + 0x10)
/** SDIO_SLCHOST_SLC_FUNC2_INT : R/W; bitpos: [24]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC_FUNC2_INT    (BIT(24))
#define SDIO_SLCHOST_SLC_FUNC2_INT_M  (SDIO_SLCHOST_SLC_FUNC2_INT_V << SDIO_SLCHOST_SLC_FUNC2_INT_S)
#define SDIO_SLCHOST_SLC_FUNC2_INT_V  0x00000001U
#define SDIO_SLCHOST_SLC_FUNC2_INT_S  24

/** SDIO_SLC_HOST_FUNC2_1_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_FUNC2_1_REG (DR_REG_HOST_BASE + 0x14)
/** SDIO_SLCHOST_SLC_FUNC2_INT_EN : R/W; bitpos: [0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC_FUNC2_INT_EN    (BIT(0))
#define SDIO_SLCHOST_SLC_FUNC2_INT_EN_M  (SDIO_SLCHOST_SLC_FUNC2_INT_EN_V << SDIO_SLCHOST_SLC_FUNC2_INT_EN_S)
#define SDIO_SLCHOST_SLC_FUNC2_INT_EN_V  0x00000001U
#define SDIO_SLCHOST_SLC_FUNC2_INT_EN_S  0

/** SDIO_SLC_HOST_FUNC2_2_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_FUNC2_2_REG (DR_REG_HOST_BASE + 0x20)
/** SDIO_SLCHOST_SLC_FUNC1_MDSTAT : R/W; bitpos: [0]; default: 1;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC_FUNC1_MDSTAT    (BIT(0))
#define SDIO_SLCHOST_SLC_FUNC1_MDSTAT_M  (SDIO_SLCHOST_SLC_FUNC1_MDSTAT_V << SDIO_SLCHOST_SLC_FUNC1_MDSTAT_S)
#define SDIO_SLCHOST_SLC_FUNC1_MDSTAT_V  0x00000001U
#define SDIO_SLCHOST_SLC_FUNC1_MDSTAT_S  0

/** SDIO_SLC_HOST_GPIO_STATUS0_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_GPIO_STATUS0_REG (DR_REG_HOST_BASE + 0x34)
/** SDIO_SLCHOST_GPIO_SDIO_INT0 : RO; bitpos: [31:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_GPIO_SDIO_INT0    0xFFFFFFFFU
#define SDIO_SLCHOST_GPIO_SDIO_INT0_M  (SDIO_SLCHOST_GPIO_SDIO_INT0_V << SDIO_SLCHOST_GPIO_SDIO_INT0_S)
#define SDIO_SLCHOST_GPIO_SDIO_INT0_V  0xFFFFFFFFU
#define SDIO_SLCHOST_GPIO_SDIO_INT0_S  0

/** SDIO_SLC_HOST_GPIO_STATUS1_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_GPIO_STATUS1_REG (DR_REG_HOST_BASE + 0x38)
/** SDIO_SLCHOST_GPIO_SDIO_INT1 : RO; bitpos: [31:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_GPIO_SDIO_INT1    0xFFFFFFFFU
#define SDIO_SLCHOST_GPIO_SDIO_INT1_M  (SDIO_SLCHOST_GPIO_SDIO_INT1_V << SDIO_SLCHOST_GPIO_SDIO_INT1_S)
#define SDIO_SLCHOST_GPIO_SDIO_INT1_V  0xFFFFFFFFU
#define SDIO_SLCHOST_GPIO_SDIO_INT1_S  0

/** SDIO_SLC_HOST_GPIO_IN0_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_GPIO_IN0_REG (DR_REG_HOST_BASE + 0x3c)
/** SDIO_SLCHOST_GPIO_SDIO_IN0 : RO; bitpos: [31:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_GPIO_SDIO_IN0    0xFFFFFFFFU
#define SDIO_SLCHOST_GPIO_SDIO_IN0_M  (SDIO_SLCHOST_GPIO_SDIO_IN0_V << SDIO_SLCHOST_GPIO_SDIO_IN0_S)
#define SDIO_SLCHOST_GPIO_SDIO_IN0_V  0xFFFFFFFFU
#define SDIO_SLCHOST_GPIO_SDIO_IN0_S  0

/** SDIO_SLC_HOST_GPIO_IN1_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_GPIO_IN1_REG (DR_REG_HOST_BASE + 0x40)
/** SDIO_SLCHOST_GPIO_SDIO_IN1 : RO; bitpos: [31:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_GPIO_SDIO_IN1    0xFFFFFFFFU
#define SDIO_SLCHOST_GPIO_SDIO_IN1_M  (SDIO_SLCHOST_GPIO_SDIO_IN1_V << SDIO_SLCHOST_GPIO_SDIO_IN1_S)
#define SDIO_SLCHOST_GPIO_SDIO_IN1_V  0xFFFFFFFFU
#define SDIO_SLCHOST_GPIO_SDIO_IN1_S  0

/** SDIO_SLC_HOST_SLC0HOST_TOKEN_RDATA_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0HOST_TOKEN_RDATA_REG (DR_REG_HOST_BASE + 0x44)
/** SDIO_SLCHOST_SLC0_TOKEN0 : RO; bitpos: [11:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0_TOKEN0    0x00000FFFU
#define SDIO_SLCHOST_SLC0_TOKEN0_M  (SDIO_SLCHOST_SLC0_TOKEN0_V << SDIO_SLCHOST_SLC0_TOKEN0_S)
#define SDIO_SLCHOST_SLC0_TOKEN0_V  0x00000FFFU
#define SDIO_SLCHOST_SLC0_TOKEN0_S  0
/** SDIO_SLCHOST_SLC0_RX_PF_VALID : RO; bitpos: [12]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0_RX_PF_VALID    (BIT(12))
#define SDIO_SLCHOST_SLC0_RX_PF_VALID_M  (SDIO_SLCHOST_SLC0_RX_PF_VALID_V << SDIO_SLCHOST_SLC0_RX_PF_VALID_S)
#define SDIO_SLCHOST_SLC0_RX_PF_VALID_V  0x00000001U
#define SDIO_SLCHOST_SLC0_RX_PF_VALID_S  12
/** SDIO_SLCHOST_HOSTSLCHOST_SLC0_TOKEN1 : RO; bitpos: [27:16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_HOSTSLCHOST_SLC0_TOKEN1    0x00000FFFU
#define SDIO_SLCHOST_HOSTSLCHOST_SLC0_TOKEN1_M  (SDIO_SLCHOST_HOSTSLCHOST_SLC0_TOKEN1_V << SDIO_SLCHOST_HOSTSLCHOST_SLC0_TOKEN1_S)
#define SDIO_SLCHOST_HOSTSLCHOST_SLC0_TOKEN1_V  0x00000FFFU
#define SDIO_SLCHOST_HOSTSLCHOST_SLC0_TOKEN1_S  16
/** SDIO_SLCHOST_SLC0_RX_PF_EOF : RO; bitpos: [31:28]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0_RX_PF_EOF    0x0000000FU
#define SDIO_SLCHOST_SLC0_RX_PF_EOF_M  (SDIO_SLCHOST_SLC0_RX_PF_EOF_V << SDIO_SLCHOST_SLC0_RX_PF_EOF_S)
#define SDIO_SLCHOST_SLC0_RX_PF_EOF_V  0x0000000FU
#define SDIO_SLCHOST_SLC0_RX_PF_EOF_S  28

/** SDIO_SLC_HOST_SLC0_HOST_PF_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0_HOST_PF_REG (DR_REG_HOST_BASE + 0x48)
/** SDIO_SLCHOST_SLC0_PF_DATA : RO; bitpos: [31:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0_PF_DATA    0xFFFFFFFFU
#define SDIO_SLCHOST_SLC0_PF_DATA_M  (SDIO_SLCHOST_SLC0_PF_DATA_V << SDIO_SLCHOST_SLC0_PF_DATA_S)
#define SDIO_SLCHOST_SLC0_PF_DATA_V  0xFFFFFFFFU
#define SDIO_SLCHOST_SLC0_PF_DATA_S  0

/** SDIO_SLC_HOST_SLC1_HOST_PF_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1_HOST_PF_REG (DR_REG_HOST_BASE + 0x4c)
/** SDIO_SLCHOST_SLC1_PF_DATA : RO; bitpos: [31:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC1_PF_DATA    0xFFFFFFFFU
#define SDIO_SLCHOST_SLC1_PF_DATA_M  (SDIO_SLCHOST_SLC1_PF_DATA_V << SDIO_SLCHOST_SLC1_PF_DATA_S)
#define SDIO_SLCHOST_SLC1_PF_DATA_V  0xFFFFFFFFU
#define SDIO_SLCHOST_SLC1_PF_DATA_S  0

/** SDIO_SLC_HOST_SLC0HOST_INT_RAW_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0HOST_INT_RAW_REG (DR_REG_HOST_BASE + 0x50)
/** SDIO_SLCHOST_SLC0_TOHOST_BIT0_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0_TOHOST_BIT0_INT_RAW    (BIT(0))
#define SDIO_SLCHOST_SLC0_TOHOST_BIT0_INT_RAW_M  (SDIO_SLCHOST_SLC0_TOHOST_BIT0_INT_RAW_V << SDIO_SLCHOST_SLC0_TOHOST_BIT0_INT_RAW_S)
#define SDIO_SLCHOST_SLC0_TOHOST_BIT0_INT_RAW_V  0x00000001U
#define SDIO_SLCHOST_SLC0_TOHOST_BIT0_INT_RAW_S  0
/** SDIO_SLCHOST_SLC0_TOHOST_BIT1_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0_TOHOST_BIT1_INT_RAW    (BIT(1))
#define SDIO_SLCHOST_SLC0_TOHOST_BIT1_INT_RAW_M  (SDIO_SLCHOST_SLC0_TOHOST_BIT1_INT_RAW_V << SDIO_SLCHOST_SLC0_TOHOST_BIT1_INT_RAW_S)
#define SDIO_SLCHOST_SLC0_TOHOST_BIT1_INT_RAW_V  0x00000001U
#define SDIO_SLCHOST_SLC0_TOHOST_BIT1_INT_RAW_S  1
/** SDIO_SLCHOST_SLC0_TOHOST_BIT2_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0_TOHOST_BIT2_INT_RAW    (BIT(2))
#define SDIO_SLCHOST_SLC0_TOHOST_BIT2_INT_RAW_M  (SDIO_SLCHOST_SLC0_TOHOST_BIT2_INT_RAW_V << SDIO_SLCHOST_SLC0_TOHOST_BIT2_INT_RAW_S)
#define SDIO_SLCHOST_SLC0_TOHOST_BIT2_INT_RAW_V  0x00000001U
#define SDIO_SLCHOST_SLC0_TOHOST_BIT2_INT_RAW_S  2
/** SDIO_SLCHOST_SLC0_TOHOST_BIT3_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0_TOHOST_BIT3_INT_RAW    (BIT(3))
#define SDIO_SLCHOST_SLC0_TOHOST_BIT3_INT_RAW_M  (SDIO_SLCHOST_SLC0_TOHOST_BIT3_INT_RAW_V << SDIO_SLCHOST_SLC0_TOHOST_BIT3_INT_RAW_S)
#define SDIO_SLCHOST_SLC0_TOHOST_BIT3_INT_RAW_V  0x00000001U
#define SDIO_SLCHOST_SLC0_TOHOST_BIT3_INT_RAW_S  3
/** SDIO_SLCHOST_SLC0_TOHOST_BIT4_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0_TOHOST_BIT4_INT_RAW    (BIT(4))
#define SDIO_SLCHOST_SLC0_TOHOST_BIT4_INT_RAW_M  (SDIO_SLCHOST_SLC0_TOHOST_BIT4_INT_RAW_V << SDIO_SLCHOST_SLC0_TOHOST_BIT4_INT_RAW_S)
#define SDIO_SLCHOST_SLC0_TOHOST_BIT4_INT_RAW_V  0x00000001U
#define SDIO_SLCHOST_SLC0_TOHOST_BIT4_INT_RAW_S  4
/** SDIO_SLCHOST_SLC0_TOHOST_BIT5_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0_TOHOST_BIT5_INT_RAW    (BIT(5))
#define SDIO_SLCHOST_SLC0_TOHOST_BIT5_INT_RAW_M  (SDIO_SLCHOST_SLC0_TOHOST_BIT5_INT_RAW_V << SDIO_SLCHOST_SLC0_TOHOST_BIT5_INT_RAW_S)
#define SDIO_SLCHOST_SLC0_TOHOST_BIT5_INT_RAW_V  0x00000001U
#define SDIO_SLCHOST_SLC0_TOHOST_BIT5_INT_RAW_S  5
/** SDIO_SLCHOST_SLC0_TOHOST_BIT6_INT_RAW : R/WTC/SS/SC; bitpos: [6]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0_TOHOST_BIT6_INT_RAW    (BIT(6))
#define SDIO_SLCHOST_SLC0_TOHOST_BIT6_INT_RAW_M  (SDIO_SLCHOST_SLC0_TOHOST_BIT6_INT_RAW_V << SDIO_SLCHOST_SLC0_TOHOST_BIT6_INT_RAW_S)
#define SDIO_SLCHOST_SLC0_TOHOST_BIT6_INT_RAW_V  0x00000001U
#define SDIO_SLCHOST_SLC0_TOHOST_BIT6_INT_RAW_S  6
/** SDIO_SLCHOST_SLC0_TOHOST_BIT7_INT_RAW : R/WTC/SS/SC; bitpos: [7]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0_TOHOST_BIT7_INT_RAW    (BIT(7))
#define SDIO_SLCHOST_SLC0_TOHOST_BIT7_INT_RAW_M  (SDIO_SLCHOST_SLC0_TOHOST_BIT7_INT_RAW_V << SDIO_SLCHOST_SLC0_TOHOST_BIT7_INT_RAW_S)
#define SDIO_SLCHOST_SLC0_TOHOST_BIT7_INT_RAW_V  0x00000001U
#define SDIO_SLCHOST_SLC0_TOHOST_BIT7_INT_RAW_S  7
/** SDIO_SLCHOST_SLC0_TOKEN0_1TO0_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0_TOKEN0_1TO0_INT_RAW    (BIT(8))
#define SDIO_SLCHOST_SLC0_TOKEN0_1TO0_INT_RAW_M  (SDIO_SLCHOST_SLC0_TOKEN0_1TO0_INT_RAW_V << SDIO_SLCHOST_SLC0_TOKEN0_1TO0_INT_RAW_S)
#define SDIO_SLCHOST_SLC0_TOKEN0_1TO0_INT_RAW_V  0x00000001U
#define SDIO_SLCHOST_SLC0_TOKEN0_1TO0_INT_RAW_S  8
/** SDIO_SLCHOST_SLC0_TOKEN1_1TO0_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0_TOKEN1_1TO0_INT_RAW    (BIT(9))
#define SDIO_SLCHOST_SLC0_TOKEN1_1TO0_INT_RAW_M  (SDIO_SLCHOST_SLC0_TOKEN1_1TO0_INT_RAW_V << SDIO_SLCHOST_SLC0_TOKEN1_1TO0_INT_RAW_S)
#define SDIO_SLCHOST_SLC0_TOKEN1_1TO0_INT_RAW_V  0x00000001U
#define SDIO_SLCHOST_SLC0_TOKEN1_1TO0_INT_RAW_S  9
/** SDIO_SLCHOST_SLC0_TOKEN0_0TO1_INT_RAW : R/WTC/SS; bitpos: [10]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0_TOKEN0_0TO1_INT_RAW    (BIT(10))
#define SDIO_SLCHOST_SLC0_TOKEN0_0TO1_INT_RAW_M  (SDIO_SLCHOST_SLC0_TOKEN0_0TO1_INT_RAW_V << SDIO_SLCHOST_SLC0_TOKEN0_0TO1_INT_RAW_S)
#define SDIO_SLCHOST_SLC0_TOKEN0_0TO1_INT_RAW_V  0x00000001U
#define SDIO_SLCHOST_SLC0_TOKEN0_0TO1_INT_RAW_S  10
/** SDIO_SLCHOST_SLC0_TOKEN1_0TO1_INT_RAW : R/WTC/SS; bitpos: [11]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0_TOKEN1_0TO1_INT_RAW    (BIT(11))
#define SDIO_SLCHOST_SLC0_TOKEN1_0TO1_INT_RAW_M  (SDIO_SLCHOST_SLC0_TOKEN1_0TO1_INT_RAW_V << SDIO_SLCHOST_SLC0_TOKEN1_0TO1_INT_RAW_S)
#define SDIO_SLCHOST_SLC0_TOKEN1_0TO1_INT_RAW_V  0x00000001U
#define SDIO_SLCHOST_SLC0_TOKEN1_0TO1_INT_RAW_S  11
/** SDIO_SLCHOST_SLC0HOST_RX_SOF_INT_RAW : R/WTC/SS; bitpos: [12]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0HOST_RX_SOF_INT_RAW    (BIT(12))
#define SDIO_SLCHOST_SLC0HOST_RX_SOF_INT_RAW_M  (SDIO_SLCHOST_SLC0HOST_RX_SOF_INT_RAW_V << SDIO_SLCHOST_SLC0HOST_RX_SOF_INT_RAW_S)
#define SDIO_SLCHOST_SLC0HOST_RX_SOF_INT_RAW_V  0x00000001U
#define SDIO_SLCHOST_SLC0HOST_RX_SOF_INT_RAW_S  12
/** SDIO_SLCHOST_SLC0HOST_RX_EOF_INT_RAW : R/WTC/SS; bitpos: [13]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0HOST_RX_EOF_INT_RAW    (BIT(13))
#define SDIO_SLCHOST_SLC0HOST_RX_EOF_INT_RAW_M  (SDIO_SLCHOST_SLC0HOST_RX_EOF_INT_RAW_V << SDIO_SLCHOST_SLC0HOST_RX_EOF_INT_RAW_S)
#define SDIO_SLCHOST_SLC0HOST_RX_EOF_INT_RAW_V  0x00000001U
#define SDIO_SLCHOST_SLC0HOST_RX_EOF_INT_RAW_S  13
/** SDIO_SLCHOST_SLC0HOST_RX_START_INT_RAW : R/WTC/SS; bitpos: [14]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0HOST_RX_START_INT_RAW    (BIT(14))
#define SDIO_SLCHOST_SLC0HOST_RX_START_INT_RAW_M  (SDIO_SLCHOST_SLC0HOST_RX_START_INT_RAW_V << SDIO_SLCHOST_SLC0HOST_RX_START_INT_RAW_S)
#define SDIO_SLCHOST_SLC0HOST_RX_START_INT_RAW_V  0x00000001U
#define SDIO_SLCHOST_SLC0HOST_RX_START_INT_RAW_S  14
/** SDIO_SLCHOST_SLC0HOST_TX_START_INT_RAW : R/WTC/SS; bitpos: [15]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0HOST_TX_START_INT_RAW    (BIT(15))
#define SDIO_SLCHOST_SLC0HOST_TX_START_INT_RAW_M  (SDIO_SLCHOST_SLC0HOST_TX_START_INT_RAW_V << SDIO_SLCHOST_SLC0HOST_TX_START_INT_RAW_S)
#define SDIO_SLCHOST_SLC0HOST_TX_START_INT_RAW_V  0x00000001U
#define SDIO_SLCHOST_SLC0HOST_TX_START_INT_RAW_S  15
/** SDIO_SLCHOST_SLC0_RX_UDF_INT_RAW : R/WTC/SS; bitpos: [16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0_RX_UDF_INT_RAW    (BIT(16))
#define SDIO_SLCHOST_SLC0_RX_UDF_INT_RAW_M  (SDIO_SLCHOST_SLC0_RX_UDF_INT_RAW_V << SDIO_SLCHOST_SLC0_RX_UDF_INT_RAW_S)
#define SDIO_SLCHOST_SLC0_RX_UDF_INT_RAW_V  0x00000001U
#define SDIO_SLCHOST_SLC0_RX_UDF_INT_RAW_S  16
/** SDIO_SLCHOST_SLC0_TX_OVF_INT_RAW : R/WTC/SS; bitpos: [17]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0_TX_OVF_INT_RAW    (BIT(17))
#define SDIO_SLCHOST_SLC0_TX_OVF_INT_RAW_M  (SDIO_SLCHOST_SLC0_TX_OVF_INT_RAW_V << SDIO_SLCHOST_SLC0_TX_OVF_INT_RAW_S)
#define SDIO_SLCHOST_SLC0_TX_OVF_INT_RAW_V  0x00000001U
#define SDIO_SLCHOST_SLC0_TX_OVF_INT_RAW_S  17
/** SDIO_SLCHOST_SLC0_RX_PF_VALID_INT_RAW : R/WTC/SS; bitpos: [18]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0_RX_PF_VALID_INT_RAW    (BIT(18))
#define SDIO_SLCHOST_SLC0_RX_PF_VALID_INT_RAW_M  (SDIO_SLCHOST_SLC0_RX_PF_VALID_INT_RAW_V << SDIO_SLCHOST_SLC0_RX_PF_VALID_INT_RAW_S)
#define SDIO_SLCHOST_SLC0_RX_PF_VALID_INT_RAW_V  0x00000001U
#define SDIO_SLCHOST_SLC0_RX_PF_VALID_INT_RAW_S  18
/** SDIO_SLCHOST_SLC0_EXT_BIT0_INT_RAW : R/WTC/SS; bitpos: [19]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0_EXT_BIT0_INT_RAW    (BIT(19))
#define SDIO_SLCHOST_SLC0_EXT_BIT0_INT_RAW_M  (SDIO_SLCHOST_SLC0_EXT_BIT0_INT_RAW_V << SDIO_SLCHOST_SLC0_EXT_BIT0_INT_RAW_S)
#define SDIO_SLCHOST_SLC0_EXT_BIT0_INT_RAW_V  0x00000001U
#define SDIO_SLCHOST_SLC0_EXT_BIT0_INT_RAW_S  19
/** SDIO_SLCHOST_SLC0_EXT_BIT1_INT_RAW : R/WTC/SS; bitpos: [20]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0_EXT_BIT1_INT_RAW    (BIT(20))
#define SDIO_SLCHOST_SLC0_EXT_BIT1_INT_RAW_M  (SDIO_SLCHOST_SLC0_EXT_BIT1_INT_RAW_V << SDIO_SLCHOST_SLC0_EXT_BIT1_INT_RAW_S)
#define SDIO_SLCHOST_SLC0_EXT_BIT1_INT_RAW_V  0x00000001U
#define SDIO_SLCHOST_SLC0_EXT_BIT1_INT_RAW_S  20
/** SDIO_SLCHOST_SLC0_EXT_BIT2_INT_RAW : R/WTC/SS; bitpos: [21]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0_EXT_BIT2_INT_RAW    (BIT(21))
#define SDIO_SLCHOST_SLC0_EXT_BIT2_INT_RAW_M  (SDIO_SLCHOST_SLC0_EXT_BIT2_INT_RAW_V << SDIO_SLCHOST_SLC0_EXT_BIT2_INT_RAW_S)
#define SDIO_SLCHOST_SLC0_EXT_BIT2_INT_RAW_V  0x00000001U
#define SDIO_SLCHOST_SLC0_EXT_BIT2_INT_RAW_S  21
/** SDIO_SLCHOST_SLC0_EXT_BIT3_INT_RAW : R/WTC/SS; bitpos: [22]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0_EXT_BIT3_INT_RAW    (BIT(22))
#define SDIO_SLCHOST_SLC0_EXT_BIT3_INT_RAW_M  (SDIO_SLCHOST_SLC0_EXT_BIT3_INT_RAW_V << SDIO_SLCHOST_SLC0_EXT_BIT3_INT_RAW_S)
#define SDIO_SLCHOST_SLC0_EXT_BIT3_INT_RAW_V  0x00000001U
#define SDIO_SLCHOST_SLC0_EXT_BIT3_INT_RAW_S  22
/** SDIO_SLCHOST_SLC0_RX_NEW_PACKET_INT_RAW : R/WTC/SS; bitpos: [23]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0_RX_NEW_PACKET_INT_RAW    (BIT(23))
#define SDIO_SLCHOST_SLC0_RX_NEW_PACKET_INT_RAW_M  (SDIO_SLCHOST_SLC0_RX_NEW_PACKET_INT_RAW_V << SDIO_SLCHOST_SLC0_RX_NEW_PACKET_INT_RAW_S)
#define SDIO_SLCHOST_SLC0_RX_NEW_PACKET_INT_RAW_V  0x00000001U
#define SDIO_SLCHOST_SLC0_RX_NEW_PACKET_INT_RAW_S  23
/** SDIO_SLCHOST_SLC0_HOST_RD_RETRY_INT_RAW : R/WTC/SS; bitpos: [24]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0_HOST_RD_RETRY_INT_RAW    (BIT(24))
#define SDIO_SLCHOST_SLC0_HOST_RD_RETRY_INT_RAW_M  (SDIO_SLCHOST_SLC0_HOST_RD_RETRY_INT_RAW_V << SDIO_SLCHOST_SLC0_HOST_RD_RETRY_INT_RAW_S)
#define SDIO_SLCHOST_SLC0_HOST_RD_RETRY_INT_RAW_V  0x00000001U
#define SDIO_SLCHOST_SLC0_HOST_RD_RETRY_INT_RAW_S  24
/** SDIO_SLCHOST_GPIO_SDIO_INT_RAW : R/WTC/SS/SC; bitpos: [25]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_GPIO_SDIO_INT_RAW    (BIT(25))
#define SDIO_SLCHOST_GPIO_SDIO_INT_RAW_M  (SDIO_SLCHOST_GPIO_SDIO_INT_RAW_V << SDIO_SLCHOST_GPIO_SDIO_INT_RAW_S)
#define SDIO_SLCHOST_GPIO_SDIO_INT_RAW_V  0x00000001U
#define SDIO_SLCHOST_GPIO_SDIO_INT_RAW_S  25

