espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_host_reg.h
/** SDIO_SLC_HOST_CONF_W1_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_CONF_W1_REG (DR_REG_HOST_BASE + 0x70)
/** SDIO_SLCHOST_SLCHOST_CONF4 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF4    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF4_M  (SDIO_SLCHOST_SLCHOST_CONF4_V << SDIO_SLCHOST_SLCHOST_CONF4_S)
#define SDIO_SLCHOST_SLCHOST_CONF4_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF4_S  0
/** SDIO_SLCHOST_SLCHOST_CONF5 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF5    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF5_M  (SDIO_SLCHOST_SLCHOST_CONF5_V << SDIO_SLCHOST_SLCHOST_CONF5_S)
#define SDIO_SLCHOST_SLCHOST_CONF5_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF5_S  8
/** SDIO_SLCHOST_SLCHOST_CONF6 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF6    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF6_M  (SDIO_SLCHOST_SLCHOST_CONF6_V << SDIO_SLCHOST_SLCHOST_CONF6_S)
#define SDIO_SLCHOST_SLCHOST_CONF6_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF6_S  16
/** SDIO_SLCHOST_SLCHOST_CONF7 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF7    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF7_M  (SDIO_SLCHOST_SLCHOST_CONF7_V << SDIO_SLCHOST_SLCHOST_CONF7_S)
#define SDIO_SLCHOST_SLCHOST_CONF7_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF7_S  24

/** SDIO_SLC_HOST_CONF_W2_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_CONF_W2_REG (DR_REG_HOST_BASE + 0x74)
/** SDIO_SLCHOST_SLCHOST_CONF8 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF8    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF8_M  (SDIO_SLCHOST_SLCHOST_CONF8_V << SDIO_SLCHOST_SLCHOST_CONF8_S)
#define SDIO_SLCHOST_SLCHOST_CONF8_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF8_S  0
/** SDIO_SLCHOST_SLCHOST_CONF9 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF9    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF9_M  (SDIO_SLCHOST_SLCHOST_CONF9_V << SDIO_SLCHOST_SLCHOST_CONF9_S)
#define SDIO_SLCHOST_SLCHOST_CONF9_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF9_S  8
/** SDIO_SLCHOST_SLCHOST_CONF10 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF10    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF10_M  (SDIO_SLCHOST_SLCHOST_CONF10_V << SDIO_SLCHOST_SLCHOST_CONF10_S)
#define SDIO_SLCHOST_SLCHOST_CONF10_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF10_S  16
/** SDIO_SLCHOST_SLCHOST_CONF11 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF11    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF11_M  (SDIO_SLCHOST_SLCHOST_CONF11_V << SDIO_SLCHOST_SLCHOST_CONF11_S)
#define SDIO_SLCHOST_SLCHOST_CONF11_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF11_S  24

/** SDIO_SLC_HOST_CONF_W3_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_CONF_W3_REG (DR_REG_HOST_BASE + 0x78)
/** SDIO_SLCHOST_SLCHOST_CONF12 : R/W; bitpos: [7:0]; default: 192;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF12    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF12_M  (SDIO_SLCHOST_SLCHOST_CONF12_V << SDIO_SLCHOST_SLCHOST_CONF12_S)
#define SDIO_SLCHOST_SLCHOST_CONF12_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF12_S  0
/** SDIO_SLCHOST_SLCHOST_CONF13 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF13    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF13_M  (SDIO_SLCHOST_SLCHOST_CONF13_V << SDIO_SLCHOST_SLCHOST_CONF13_S)
#define SDIO_SLCHOST_SLCHOST_CONF13_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF13_S  8
/** SDIO_SLCHOST_SLCHOST_CONF14 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF14    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF14_M  (SDIO_SLCHOST_SLCHOST_CONF14_V << SDIO_SLCHOST_SLCHOST_CONF14_S)
#define SDIO_SLCHOST_SLCHOST_CONF14_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF14_S  16
/** SDIO_SLCHOST_SLCHOST_CONF15 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF15    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF15_M  (SDIO_SLCHOST_SLCHOST_CONF15_V << SDIO_SLCHOST_SLCHOST_CONF15_S)
#define SDIO_SLCHOST_SLCHOST_CONF15_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF15_S  24

/** SDIO_SLC_HOST_CONF_W4_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_CONF_W4_REG (DR_REG_HOST_BASE + 0x7c)
/** SDIO_SLCHOST_SLCHOST_CONF16 : R/W; bitpos: [7:0]; default: 255;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF16    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF16_M  (SDIO_SLCHOST_SLCHOST_CONF16_V << SDIO_SLCHOST_SLCHOST_CONF16_S)
#define SDIO_SLCHOST_SLCHOST_CONF16_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF16_S  0
/** SDIO_SLCHOST_SLCHOST_CONF17 : R/W; bitpos: [15:8]; default: 1;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF17    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF17_M  (SDIO_SLCHOST_SLCHOST_CONF17_V << SDIO_SLCHOST_SLCHOST_CONF17_S)
#define SDIO_SLCHOST_SLCHOST_CONF17_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF17_S  8
/** SDIO_SLCHOST_SLCHOST_CONF18 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF18    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF18_M  (SDIO_SLCHOST_SLCHOST_CONF18_V << SDIO_SLCHOST_SLCHOST_CONF18_S)
#define SDIO_SLCHOST_SLCHOST_CONF18_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF18_S  16
/** SDIO_SLCHOST_SLCHOST_CONF19 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF19    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF19_M  (SDIO_SLCHOST_SLCHOST_CONF19_V << SDIO_SLCHOST_SLCHOST_CONF19_S)
#define SDIO_SLCHOST_SLCHOST_CONF19_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF19_S  24

/** SDIO_SLC_HOST_CONF_W5_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_CONF_W5_REG (DR_REG_HOST_BASE + 0x80)
/** SDIO_SLCHOST_SLCHOST_CONF20 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF20    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF20_M  (SDIO_SLCHOST_SLCHOST_CONF20_V << SDIO_SLCHOST_SLCHOST_CONF20_S)
#define SDIO_SLCHOST_SLCHOST_CONF20_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF20_S  0
/** SDIO_SLCHOST_SLCHOST_CONF21 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF21    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF21_M  (SDIO_SLCHOST_SLCHOST_CONF21_V << SDIO_SLCHOST_SLCHOST_CONF21_S)
#define SDIO_SLCHOST_SLCHOST_CONF21_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF21_S  8
/** SDIO_SLCHOST_SLCHOST_CONF22 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF22    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF22_M  (SDIO_SLCHOST_SLCHOST_CONF22_V << SDIO_SLCHOST_SLCHOST_CONF22_S)
#define SDIO_SLCHOST_SLCHOST_CONF22_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF22_S  16
/** SDIO_SLCHOST_SLCHOST_CONF23 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF23    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF23_M  (SDIO_SLCHOST_SLCHOST_CONF23_V << SDIO_SLCHOST_SLCHOST_CONF23_S)
#define SDIO_SLCHOST_SLCHOST_CONF23_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF23_S  24

