espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_host_reg.h
/** SDIO_SLC_HOST_CONF_W13_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_CONF_W13_REG (DR_REG_HOST_BASE + 0xb0)
/** SDIO_SLCHOST_SLCHOST_CONF52 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF52    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF52_M  (SDIO_SLCHOST_SLCHOST_CONF52_V << SDIO_SLCHOST_SLCHOST_CONF52_S)
#define SDIO_SLCHOST_SLCHOST_CONF52_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF52_S  0
/** SDIO_SLCHOST_SLCHOST_CONF53 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF53    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF53_M  (SDIO_SLCHOST_SLCHOST_CONF53_V << SDIO_SLCHOST_SLCHOST_CONF53_S)
#define SDIO_SLCHOST_SLCHOST_CONF53_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF53_S  8
/** SDIO_SLCHOST_SLCHOST_CONF54 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF54    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF54_M  (SDIO_SLCHOST_SLCHOST_CONF54_V << SDIO_SLCHOST_SLCHOST_CONF54_S)
#define SDIO_SLCHOST_SLCHOST_CONF54_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF54_S  16
/** SDIO_SLCHOST_SLCHOST_CONF55 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF55    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF55_M  (SDIO_SLCHOST_SLCHOST_CONF55_V << SDIO_SLCHOST_SLCHOST_CONF55_S)
#define SDIO_SLCHOST_SLCHOST_CONF55_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF55_S  24

/** SDIO_SLC_HOST_CONF_W14_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_CONF_W14_REG (DR_REG_HOST_BASE + 0xb4)
/** SDIO_SLCHOST_SLCHOST_CONF56 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF56    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF56_M  (SDIO_SLCHOST_SLCHOST_CONF56_V << SDIO_SLCHOST_SLCHOST_CONF56_S)
#define SDIO_SLCHOST_SLCHOST_CONF56_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF56_S  0
/** SDIO_SLCHOST_SLCHOST_CONF57 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF57    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF57_M  (SDIO_SLCHOST_SLCHOST_CONF57_V << SDIO_SLCHOST_SLCHOST_CONF57_S)
#define SDIO_SLCHOST_SLCHOST_CONF57_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF57_S  8
/** SDIO_SLCHOST_SLCHOST_CONF58 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF58    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF58_M  (SDIO_SLCHOST_SLCHOST_CONF58_V << SDIO_SLCHOST_SLCHOST_CONF58_S)
#define SDIO_SLCHOST_SLCHOST_CONF58_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF58_S  16
/** SDIO_SLCHOST_SLCHOST_CONF59 : R/W; bitpos: [31:24]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF59    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF59_M  (SDIO_SLCHOST_SLCHOST_CONF59_V << SDIO_SLCHOST_SLCHOST_CONF59_S)
#define SDIO_SLCHOST_SLCHOST_CONF59_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF59_S  24

/** SDIO_SLC_HOST_CONF_W15_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_CONF_W15_REG (DR_REG_HOST_BASE + 0xb8)
/** SDIO_SLCHOST_SLCHOST_CONF60 : R/W; bitpos: [7:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF60    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF60_M  (SDIO_SLCHOST_SLCHOST_CONF60_V << SDIO_SLCHOST_SLCHOST_CONF60_S)
#define SDIO_SLCHOST_SLCHOST_CONF60_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF60_S  0
/** SDIO_SLCHOST_SLCHOST_CONF61 : R/W; bitpos: [15:8]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF61    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF61_M  (SDIO_SLCHOST_SLCHOST_CONF61_V << SDIO_SLCHOST_SLCHOST_CONF61_S)
#define SDIO_SLCHOST_SLCHOST_CONF61_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF61_S  8
/** SDIO_SLCHOST_SLCHOST_CONF62 : R/W; bitpos: [23:16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CONF62    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF62_M  (SDIO_SLCHOST_SLCHOST_CONF62_V << SDIO_SLCHOST_SLCHOST_CONF62_S)
#define SDIO_SLCHOST_SLCHOST_CONF62_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF62_S  16
/** SDIO_SLCHOST_SLCHOST_CONF63 : R/W; bitpos: [31:24]; default: 0;
 *  Bit [27:24] used for reg_slc_apbwin_addr[31:28]
 */
#define SDIO_SLCHOST_SLCHOST_CONF63    0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF63_M  (SDIO_SLCHOST_SLCHOST_CONF63_V << SDIO_SLCHOST_SLCHOST_CONF63_S)
#define SDIO_SLCHOST_SLCHOST_CONF63_V  0x000000FFU
#define SDIO_SLCHOST_SLCHOST_CONF63_S  24

/** SDIO_SLC_HOST_CHECK_SUM0_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_CHECK_SUM0_REG (DR_REG_HOST_BASE + 0xbc)
/** SDIO_SLCHOST_SLCHOST_CHECK_SUM0 : RO; bitpos: [31:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CHECK_SUM0    0xFFFFFFFFU
#define SDIO_SLCHOST_SLCHOST_CHECK_SUM0_M  (SDIO_SLCHOST_SLCHOST_CHECK_SUM0_V << SDIO_SLCHOST_SLCHOST_CHECK_SUM0_S)
#define SDIO_SLCHOST_SLCHOST_CHECK_SUM0_V  0xFFFFFFFFU
#define SDIO_SLCHOST_SLCHOST_CHECK_SUM0_S  0

/** SDIO_SLC_HOST_CHECK_SUM1_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_CHECK_SUM1_REG (DR_REG_HOST_BASE + 0xc0)
/** SDIO_SLCHOST_SLCHOST_CHECK_SUM1 : RO; bitpos: [31:0]; default: 319;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLCHOST_CHECK_SUM1    0xFFFFFFFFU
#define SDIO_SLCHOST_SLCHOST_CHECK_SUM1_M  (SDIO_SLCHOST_SLCHOST_CHECK_SUM1_V << SDIO_SLCHOST_SLCHOST_CHECK_SUM1_S)
#define SDIO_SLCHOST_SLCHOST_CHECK_SUM1_V  0xFFFFFFFFU
#define SDIO_SLCHOST_SLCHOST_CHECK_SUM1_S  0

/** SDIO_SLC_HOST_SLC1HOST_TOKEN_RDATA_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1HOST_TOKEN_RDATA_REG (DR_REG_HOST_BASE + 0xc4)
/** SDIO_SLCHOST_SLC1_TOKEN0 : RO; bitpos: [11:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC1_TOKEN0    0x00000FFFU
#define SDIO_SLCHOST_SLC1_TOKEN0_M  (SDIO_SLCHOST_SLC1_TOKEN0_V << SDIO_SLCHOST_SLC1_TOKEN0_S)
#define SDIO_SLCHOST_SLC1_TOKEN0_V  0x00000FFFU
#define SDIO_SLCHOST_SLC1_TOKEN0_S  0
/** SDIO_SLCHOST_SLC1_RX_PF_VALID : RO; bitpos: [12]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC1_RX_PF_VALID    (BIT(12))
#define SDIO_SLCHOST_SLC1_RX_PF_VALID_M  (SDIO_SLCHOST_SLC1_RX_PF_VALID_V << SDIO_SLCHOST_SLC1_RX_PF_VALID_S)
#define SDIO_SLCHOST_SLC1_RX_PF_VALID_V  0x00000001U
#define SDIO_SLCHOST_SLC1_RX_PF_VALID_S  12
/** SDIO_SLCHOST_HOSTSLCHOST_SLC1_TOKEN1 : RO; bitpos: [27:16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_HOSTSLCHOST_SLC1_TOKEN1    0x00000FFFU
#define SDIO_SLCHOST_HOSTSLCHOST_SLC1_TOKEN1_M  (SDIO_SLCHOST_HOSTSLCHOST_SLC1_TOKEN1_V << SDIO_SLCHOST_HOSTSLCHOST_SLC1_TOKEN1_S)
#define SDIO_SLCHOST_HOSTSLCHOST_SLC1_TOKEN1_V  0x00000FFFU
#define SDIO_SLCHOST_HOSTSLCHOST_SLC1_TOKEN1_S  16
/** SDIO_SLCHOST_SLC1_RX_PF_EOF : RO; bitpos: [31:28]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC1_RX_PF_EOF    0x0000000FU
#define SDIO_SLCHOST_SLC1_RX_PF_EOF_M  (SDIO_SLCHOST_SLC1_RX_PF_EOF_V << SDIO_SLCHOST_SLC1_RX_PF_EOF_S)
#define SDIO_SLCHOST_SLC1_RX_PF_EOF_V  0x0000000FU
#define SDIO_SLCHOST_SLC1_RX_PF_EOF_S  28

/** SDIO_SLC_HOST_SLC0HOST_TOKEN_WDATA_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0HOST_TOKEN_WDATA_REG (DR_REG_HOST_BASE + 0xc8)
/** SDIO_SLCHOST_SLC0HOST_TOKEN0_WD : R/W; bitpos: [11:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0HOST_TOKEN0_WD    0x00000FFFU
#define SDIO_SLCHOST_SLC0HOST_TOKEN0_WD_M  (SDIO_SLCHOST_SLC0HOST_TOKEN0_WD_V << SDIO_SLCHOST_SLC0HOST_TOKEN0_WD_S)
#define SDIO_SLCHOST_SLC0HOST_TOKEN0_WD_V  0x00000FFFU
#define SDIO_SLCHOST_SLC0HOST_TOKEN0_WD_S  0
/** SDIO_SLCHOST_SLC0HOST_TOKEN1_WD : R/W; bitpos: [27:16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0HOST_TOKEN1_WD    0x00000FFFU
#define SDIO_SLCHOST_SLC0HOST_TOKEN1_WD_M  (SDIO_SLCHOST_SLC0HOST_TOKEN1_WD_V << SDIO_SLCHOST_SLC0HOST_TOKEN1_WD_S)
#define SDIO_SLCHOST_SLC0HOST_TOKEN1_WD_V  0x00000FFFU
#define SDIO_SLCHOST_SLC0HOST_TOKEN1_WD_S  16

/** SDIO_SLC_HOST_SLC1HOST_TOKEN_WDATA_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1HOST_TOKEN_WDATA_REG (DR_REG_HOST_BASE + 0xcc)
/** SDIO_SLCHOST_SLC1HOST_TOKEN0_WD : R/W; bitpos: [11:0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC1HOST_TOKEN0_WD    0x00000FFFU
#define SDIO_SLCHOST_SLC1HOST_TOKEN0_WD_M  (SDIO_SLCHOST_SLC1HOST_TOKEN0_WD_V << SDIO_SLCHOST_SLC1HOST_TOKEN0_WD_S)
#define SDIO_SLCHOST_SLC1HOST_TOKEN0_WD_V  0x00000FFFU
#define SDIO_SLCHOST_SLC1HOST_TOKEN0_WD_S  0
/** SDIO_SLCHOST_SLC1HOST_TOKEN1_WD : R/W; bitpos: [27:16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC1HOST_TOKEN1_WD    0x00000FFFU
#define SDIO_SLCHOST_SLC1HOST_TOKEN1_WD_M  (SDIO_SLCHOST_SLC1HOST_TOKEN1_WD_V << SDIO_SLCHOST_SLC1HOST_TOKEN1_WD_S)
#define SDIO_SLCHOST_SLC1HOST_TOKEN1_WD_V  0x00000FFFU
#define SDIO_SLCHOST_SLC1HOST_TOKEN1_WD_S  16

/** SDIO_SLC_HOST_TOKEN_CON_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_TOKEN_CON_REG (DR_REG_HOST_BASE + 0xd0)
/** SDIO_SLCHOST_SLC0HOST_TOKEN0_DEC : WT; bitpos: [0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0HOST_TOKEN0_DEC    (BIT(0))
#define SDIO_SLCHOST_SLC0HOST_TOKEN0_DEC_M  (SDIO_SLCHOST_SLC0HOST_TOKEN0_DEC_V << SDIO_SLCHOST_SLC0HOST_TOKEN0_DEC_S)
#define SDIO_SLCHOST_SLC0HOST_TOKEN0_DEC_V  0x00000001U
#define SDIO_SLCHOST_SLC0HOST_TOKEN0_DEC_S  0
/** SDIO_SLCHOST_SLC0HOST_TOKEN1_DEC : WT; bitpos: [1]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0HOST_TOKEN1_DEC    (BIT(1))
#define SDIO_SLCHOST_SLC0HOST_TOKEN1_DEC_M  (SDIO_SLCHOST_SLC0HOST_TOKEN1_DEC_V << SDIO_SLCHOST_SLC0HOST_TOKEN1_DEC_S)
#define SDIO_SLCHOST_SLC0HOST_TOKEN1_DEC_V  0x00000001U
#define SDIO_SLCHOST_SLC0HOST_TOKEN1_DEC_S  1
/** SDIO_SLCHOST_SLC0HOST_TOKEN0_WR : WT; bitpos: [2]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0HOST_TOKEN0_WR    (BIT(2))
#define SDIO_SLCHOST_SLC0HOST_TOKEN0_WR_M  (SDIO_SLCHOST_SLC0HOST_TOKEN0_WR_V << SDIO_SLCHOST_SLC0HOST_TOKEN0_WR_S)
#define SDIO_SLCHOST_SLC0HOST_TOKEN0_WR_V  0x00000001U
#define SDIO_SLCHOST_SLC0HOST_TOKEN0_WR_S  2
/** SDIO_SLCHOST_SLC0HOST_TOKEN1_WR : WT; bitpos: [3]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0HOST_TOKEN1_WR    (BIT(3))
#define SDIO_SLCHOST_SLC0HOST_TOKEN1_WR_M  (SDIO_SLCHOST_SLC0HOST_TOKEN1_WR_V << SDIO_SLCHOST_SLC0HOST_TOKEN1_WR_S)
#define SDIO_SLCHOST_SLC0HOST_TOKEN1_WR_V  0x00000001U
#define SDIO_SLCHOST_SLC0HOST_TOKEN1_WR_S  3
/** SDIO_SLCHOST_SLC1HOST_TOKEN0_DEC : WT; bitpos: [4]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC1HOST_TOKEN0_DEC    (BIT(4))
#define SDIO_SLCHOST_SLC1HOST_TOKEN0_DEC_M  (SDIO_SLCHOST_SLC1HOST_TOKEN0_DEC_V << SDIO_SLCHOST_SLC1HOST_TOKEN0_DEC_S)
#define SDIO_SLCHOST_SLC1HOST_TOKEN0_DEC_V  0x00000001U
#define SDIO_SLCHOST_SLC1HOST_TOKEN0_DEC_S  4
/** SDIO_SLCHOST_SLC1HOST_TOKEN1_DEC : WT; bitpos: [5]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC1HOST_TOKEN1_DEC    (BIT(5))
#define SDIO_SLCHOST_SLC1HOST_TOKEN1_DEC_M  (SDIO_SLCHOST_SLC1HOST_TOKEN1_DEC_V << SDIO_SLCHOST_SLC1HOST_TOKEN1_DEC_S)
#define SDIO_SLCHOST_SLC1HOST_TOKEN1_DEC_V  0x00000001U
#define SDIO_SLCHOST_SLC1HOST_TOKEN1_DEC_S  5
/** SDIO_SLCHOST_SLC1HOST_TOKEN0_WR : WT; bitpos: [6]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC1HOST_TOKEN0_WR    (BIT(6))
#define SDIO_SLCHOST_SLC1HOST_TOKEN0_WR_M  (SDIO_SLCHOST_SLC1HOST_TOKEN0_WR_V << SDIO_SLCHOST_SLC1HOST_TOKEN0_WR_S)
#define SDIO_SLCHOST_SLC1HOST_TOKEN0_WR_V  0x00000001U
#define SDIO_SLCHOST_SLC1HOST_TOKEN0_WR_S  6
/** SDIO_SLCHOST_SLC1HOST_TOKEN1_WR : WT; bitpos: [7]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC1HOST_TOKEN1_WR    (BIT(7))
#define SDIO_SLCHOST_SLC1HOST_TOKEN1_WR_M  (SDIO_SLCHOST_SLC1HOST_TOKEN1_WR_V << SDIO_SLCHOST_SLC1HOST_TOKEN1_WR_S)
#define SDIO_SLCHOST_SLC1HOST_TOKEN1_WR_V  0x00000001U
#define SDIO_SLCHOST_SLC1HOST_TOKEN1_WR_S  7
/** SDIO_SLCHOST_SLC0HOST_LEN_WR : WT; bitpos: [8]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_SLC0HOST_LEN_WR    (BIT(8))
#define SDIO_SLCHOST_SLC0HOST_LEN_WR_M  (SDIO_SLCHOST_SLC0HOST_LEN_WR_V << SDIO_SLCHOST_SLC0HOST_LEN_WR_S)
#define SDIO_SLCHOST_SLC0HOST_LEN_WR_V  0x00000001U
#define SDIO_SLCHOST_SLC0HOST_LEN_WR_S  8

