espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_host_reg.h
/** SDIO_SLC_HOST_SLC0HOST_FUNC1_INT_ENA_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC0HOST_FUNC1_INT_ENA_REG (DR_REG_HOST_BASE + 0xdc)
/** SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT0_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT0_INT_ENA    (BIT(0))
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT0_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT0_INT_ENA_V << SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT0_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT0_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT0_INT_ENA_S  0
/** SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT1_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT1_INT_ENA    (BIT(1))
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT1_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT1_INT_ENA_V << SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT1_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT1_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT1_INT_ENA_S  1
/** SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT2_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT2_INT_ENA    (BIT(2))
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT2_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT2_INT_ENA_V << SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT2_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT2_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT2_INT_ENA_S  2
/** SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT3_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT3_INT_ENA    (BIT(3))
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT3_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT3_INT_ENA_V << SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT3_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT3_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT3_INT_ENA_S  3
/** SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT4_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT4_INT_ENA    (BIT(4))
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT4_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT4_INT_ENA_V << SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT4_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT4_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT4_INT_ENA_S  4
/** SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT5_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT5_INT_ENA    (BIT(5))
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT5_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT5_INT_ENA_V << SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT5_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT5_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT5_INT_ENA_S  5
/** SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT6_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT6_INT_ENA    (BIT(6))
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT6_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT6_INT_ENA_V << SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT6_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT6_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT6_INT_ENA_S  6
/** SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT7_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT7_INT_ENA    (BIT(7))
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT7_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT7_INT_ENA_V << SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT7_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT7_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC0_TOHOST_BIT7_INT_ENA_S  7
/** SDIO_SLCHOST_FN1_SLC0_TOKEN0_1TO0_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC0_TOKEN0_1TO0_INT_ENA    (BIT(8))
#define SDIO_SLCHOST_FN1_SLC0_TOKEN0_1TO0_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC0_TOKEN0_1TO0_INT_ENA_V << SDIO_SLCHOST_FN1_SLC0_TOKEN0_1TO0_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC0_TOKEN0_1TO0_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC0_TOKEN0_1TO0_INT_ENA_S  8
/** SDIO_SLCHOST_FN1_SLC0_TOKEN1_1TO0_INT_ENA : R/W; bitpos: [9]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC0_TOKEN1_1TO0_INT_ENA    (BIT(9))
#define SDIO_SLCHOST_FN1_SLC0_TOKEN1_1TO0_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC0_TOKEN1_1TO0_INT_ENA_V << SDIO_SLCHOST_FN1_SLC0_TOKEN1_1TO0_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC0_TOKEN1_1TO0_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC0_TOKEN1_1TO0_INT_ENA_S  9
/** SDIO_SLCHOST_FN1_SLC0_TOKEN0_0TO1_INT_ENA : R/W; bitpos: [10]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC0_TOKEN0_0TO1_INT_ENA    (BIT(10))
#define SDIO_SLCHOST_FN1_SLC0_TOKEN0_0TO1_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC0_TOKEN0_0TO1_INT_ENA_V << SDIO_SLCHOST_FN1_SLC0_TOKEN0_0TO1_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC0_TOKEN0_0TO1_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC0_TOKEN0_0TO1_INT_ENA_S  10
/** SDIO_SLCHOST_FN1_SLC0_TOKEN1_0TO1_INT_ENA : R/W; bitpos: [11]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC0_TOKEN1_0TO1_INT_ENA    (BIT(11))
#define SDIO_SLCHOST_FN1_SLC0_TOKEN1_0TO1_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC0_TOKEN1_0TO1_INT_ENA_V << SDIO_SLCHOST_FN1_SLC0_TOKEN1_0TO1_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC0_TOKEN1_0TO1_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC0_TOKEN1_0TO1_INT_ENA_S  11
/** SDIO_SLCHOST_FN1_SLC0HOST_RX_SOF_INT_ENA : R/W; bitpos: [12]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC0HOST_RX_SOF_INT_ENA    (BIT(12))
#define SDIO_SLCHOST_FN1_SLC0HOST_RX_SOF_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC0HOST_RX_SOF_INT_ENA_V << SDIO_SLCHOST_FN1_SLC0HOST_RX_SOF_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC0HOST_RX_SOF_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC0HOST_RX_SOF_INT_ENA_S  12
/** SDIO_SLCHOST_FN1_SLC0HOST_RX_EOF_INT_ENA : R/W; bitpos: [13]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC0HOST_RX_EOF_INT_ENA    (BIT(13))
#define SDIO_SLCHOST_FN1_SLC0HOST_RX_EOF_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC0HOST_RX_EOF_INT_ENA_V << SDIO_SLCHOST_FN1_SLC0HOST_RX_EOF_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC0HOST_RX_EOF_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC0HOST_RX_EOF_INT_ENA_S  13
/** SDIO_SLCHOST_FN1_SLC0HOST_RX_START_INT_ENA : R/W; bitpos: [14]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC0HOST_RX_START_INT_ENA    (BIT(14))
#define SDIO_SLCHOST_FN1_SLC0HOST_RX_START_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC0HOST_RX_START_INT_ENA_V << SDIO_SLCHOST_FN1_SLC0HOST_RX_START_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC0HOST_RX_START_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC0HOST_RX_START_INT_ENA_S  14
/** SDIO_SLCHOST_FN1_SLC0HOST_TX_START_INT_ENA : R/W; bitpos: [15]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC0HOST_TX_START_INT_ENA    (BIT(15))
#define SDIO_SLCHOST_FN1_SLC0HOST_TX_START_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC0HOST_TX_START_INT_ENA_V << SDIO_SLCHOST_FN1_SLC0HOST_TX_START_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC0HOST_TX_START_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC0HOST_TX_START_INT_ENA_S  15
/** SDIO_SLCHOST_FN1_SLC0_RX_UDF_INT_ENA : R/W; bitpos: [16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC0_RX_UDF_INT_ENA    (BIT(16))
#define SDIO_SLCHOST_FN1_SLC0_RX_UDF_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC0_RX_UDF_INT_ENA_V << SDIO_SLCHOST_FN1_SLC0_RX_UDF_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC0_RX_UDF_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC0_RX_UDF_INT_ENA_S  16
/** SDIO_SLCHOST_FN1_SLC0_TX_OVF_INT_ENA : R/W; bitpos: [17]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC0_TX_OVF_INT_ENA    (BIT(17))
#define SDIO_SLCHOST_FN1_SLC0_TX_OVF_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC0_TX_OVF_INT_ENA_V << SDIO_SLCHOST_FN1_SLC0_TX_OVF_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC0_TX_OVF_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC0_TX_OVF_INT_ENA_S  17
/** SDIO_SLCHOST_FN1_SLC0_RX_PF_VALID_INT_ENA : R/W; bitpos: [18]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC0_RX_PF_VALID_INT_ENA    (BIT(18))
#define SDIO_SLCHOST_FN1_SLC0_RX_PF_VALID_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC0_RX_PF_VALID_INT_ENA_V << SDIO_SLCHOST_FN1_SLC0_RX_PF_VALID_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC0_RX_PF_VALID_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC0_RX_PF_VALID_INT_ENA_S  18
/** SDIO_SLCHOST_FN1_SLC0_EXT_BIT0_INT_ENA : R/W; bitpos: [19]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC0_EXT_BIT0_INT_ENA    (BIT(19))
#define SDIO_SLCHOST_FN1_SLC0_EXT_BIT0_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC0_EXT_BIT0_INT_ENA_V << SDIO_SLCHOST_FN1_SLC0_EXT_BIT0_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC0_EXT_BIT0_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC0_EXT_BIT0_INT_ENA_S  19
/** SDIO_SLCHOST_FN1_SLC0_EXT_BIT1_INT_ENA : R/W; bitpos: [20]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC0_EXT_BIT1_INT_ENA    (BIT(20))
#define SDIO_SLCHOST_FN1_SLC0_EXT_BIT1_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC0_EXT_BIT1_INT_ENA_V << SDIO_SLCHOST_FN1_SLC0_EXT_BIT1_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC0_EXT_BIT1_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC0_EXT_BIT1_INT_ENA_S  20
/** SDIO_SLCHOST_FN1_SLC0_EXT_BIT2_INT_ENA : R/W; bitpos: [21]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC0_EXT_BIT2_INT_ENA    (BIT(21))
#define SDIO_SLCHOST_FN1_SLC0_EXT_BIT2_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC0_EXT_BIT2_INT_ENA_V << SDIO_SLCHOST_FN1_SLC0_EXT_BIT2_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC0_EXT_BIT2_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC0_EXT_BIT2_INT_ENA_S  21
/** SDIO_SLCHOST_FN1_SLC0_EXT_BIT3_INT_ENA : R/W; bitpos: [22]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC0_EXT_BIT3_INT_ENA    (BIT(22))
#define SDIO_SLCHOST_FN1_SLC0_EXT_BIT3_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC0_EXT_BIT3_INT_ENA_V << SDIO_SLCHOST_FN1_SLC0_EXT_BIT3_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC0_EXT_BIT3_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC0_EXT_BIT3_INT_ENA_S  22
/** SDIO_SLCHOST_FN1_SLC0_RX_NEW_PACKET_INT_ENA : R/W; bitpos: [23]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC0_RX_NEW_PACKET_INT_ENA    (BIT(23))
#define SDIO_SLCHOST_FN1_SLC0_RX_NEW_PACKET_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC0_RX_NEW_PACKET_INT_ENA_V << SDIO_SLCHOST_FN1_SLC0_RX_NEW_PACKET_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC0_RX_NEW_PACKET_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC0_RX_NEW_PACKET_INT_ENA_S  23
/** SDIO_SLCHOST_FN1_SLC0_HOST_RD_RETRY_INT_ENA : R/W; bitpos: [24]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC0_HOST_RD_RETRY_INT_ENA    (BIT(24))
#define SDIO_SLCHOST_FN1_SLC0_HOST_RD_RETRY_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC0_HOST_RD_RETRY_INT_ENA_V << SDIO_SLCHOST_FN1_SLC0_HOST_RD_RETRY_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC0_HOST_RD_RETRY_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC0_HOST_RD_RETRY_INT_ENA_S  24
/** SDIO_SLCHOST_FN1_GPIO_SDIO_INT_ENA : R/W; bitpos: [25]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_GPIO_SDIO_INT_ENA    (BIT(25))
#define SDIO_SLCHOST_FN1_GPIO_SDIO_INT_ENA_M  (SDIO_SLCHOST_FN1_GPIO_SDIO_INT_ENA_V << SDIO_SLCHOST_FN1_GPIO_SDIO_INT_ENA_S)
#define SDIO_SLCHOST_FN1_GPIO_SDIO_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_GPIO_SDIO_INT_ENA_S  25

/** SDIO_SLC_HOST_SLC1HOST_FUNC1_INT_ENA_REG register
 *  *******Description***********
 */
#define SDIO_SLC_HOST_SLC1HOST_FUNC1_INT_ENA_REG (DR_REG_HOST_BASE + 0xe0)
/** SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT0_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT0_INT_ENA    (BIT(0))
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT0_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT0_INT_ENA_V << SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT0_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT0_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT0_INT_ENA_S  0
/** SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT1_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT1_INT_ENA    (BIT(1))
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT1_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT1_INT_ENA_V << SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT1_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT1_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT1_INT_ENA_S  1
/** SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT2_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT2_INT_ENA    (BIT(2))
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT2_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT2_INT_ENA_V << SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT2_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT2_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT2_INT_ENA_S  2
/** SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT3_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT3_INT_ENA    (BIT(3))
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT3_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT3_INT_ENA_V << SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT3_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT3_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT3_INT_ENA_S  3
/** SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT4_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT4_INT_ENA    (BIT(4))
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT4_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT4_INT_ENA_V << SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT4_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT4_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT4_INT_ENA_S  4
/** SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT5_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT5_INT_ENA    (BIT(5))
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT5_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT5_INT_ENA_V << SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT5_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT5_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT5_INT_ENA_S  5
/** SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT6_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT6_INT_ENA    (BIT(6))
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT6_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT6_INT_ENA_V << SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT6_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT6_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT6_INT_ENA_S  6
/** SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT7_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT7_INT_ENA    (BIT(7))
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT7_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT7_INT_ENA_V << SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT7_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT7_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC1_TOHOST_BIT7_INT_ENA_S  7
/** SDIO_SLCHOST_FN1_SLC1_TOKEN0_1TO0_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC1_TOKEN0_1TO0_INT_ENA    (BIT(8))
#define SDIO_SLCHOST_FN1_SLC1_TOKEN0_1TO0_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC1_TOKEN0_1TO0_INT_ENA_V << SDIO_SLCHOST_FN1_SLC1_TOKEN0_1TO0_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC1_TOKEN0_1TO0_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC1_TOKEN0_1TO0_INT_ENA_S  8
/** SDIO_SLCHOST_FN1_SLC1_TOKEN1_1TO0_INT_ENA : R/W; bitpos: [9]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC1_TOKEN1_1TO0_INT_ENA    (BIT(9))
#define SDIO_SLCHOST_FN1_SLC1_TOKEN1_1TO0_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC1_TOKEN1_1TO0_INT_ENA_V << SDIO_SLCHOST_FN1_SLC1_TOKEN1_1TO0_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC1_TOKEN1_1TO0_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC1_TOKEN1_1TO0_INT_ENA_S  9
/** SDIO_SLCHOST_FN1_SLC1_TOKEN0_0TO1_INT_ENA : R/W; bitpos: [10]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC1_TOKEN0_0TO1_INT_ENA    (BIT(10))
#define SDIO_SLCHOST_FN1_SLC1_TOKEN0_0TO1_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC1_TOKEN0_0TO1_INT_ENA_V << SDIO_SLCHOST_FN1_SLC1_TOKEN0_0TO1_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC1_TOKEN0_0TO1_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC1_TOKEN0_0TO1_INT_ENA_S  10
/** SDIO_SLCHOST_FN1_SLC1_TOKEN1_0TO1_INT_ENA : R/W; bitpos: [11]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC1_TOKEN1_0TO1_INT_ENA    (BIT(11))
#define SDIO_SLCHOST_FN1_SLC1_TOKEN1_0TO1_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC1_TOKEN1_0TO1_INT_ENA_V << SDIO_SLCHOST_FN1_SLC1_TOKEN1_0TO1_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC1_TOKEN1_0TO1_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC1_TOKEN1_0TO1_INT_ENA_S  11
/** SDIO_SLCHOST_FN1_SLC1HOST_RX_SOF_INT_ENA : R/W; bitpos: [12]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC1HOST_RX_SOF_INT_ENA    (BIT(12))
#define SDIO_SLCHOST_FN1_SLC1HOST_RX_SOF_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC1HOST_RX_SOF_INT_ENA_V << SDIO_SLCHOST_FN1_SLC1HOST_RX_SOF_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC1HOST_RX_SOF_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC1HOST_RX_SOF_INT_ENA_S  12
/** SDIO_SLCHOST_FN1_SLC1HOST_RX_EOF_INT_ENA : R/W; bitpos: [13]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC1HOST_RX_EOF_INT_ENA    (BIT(13))
#define SDIO_SLCHOST_FN1_SLC1HOST_RX_EOF_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC1HOST_RX_EOF_INT_ENA_V << SDIO_SLCHOST_FN1_SLC1HOST_RX_EOF_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC1HOST_RX_EOF_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC1HOST_RX_EOF_INT_ENA_S  13
/** SDIO_SLCHOST_FN1_SLC1HOST_RX_START_INT_ENA : R/W; bitpos: [14]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC1HOST_RX_START_INT_ENA    (BIT(14))
#define SDIO_SLCHOST_FN1_SLC1HOST_RX_START_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC1HOST_RX_START_INT_ENA_V << SDIO_SLCHOST_FN1_SLC1HOST_RX_START_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC1HOST_RX_START_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC1HOST_RX_START_INT_ENA_S  14
/** SDIO_SLCHOST_FN1_SLC1HOST_TX_START_INT_ENA : R/W; bitpos: [15]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC1HOST_TX_START_INT_ENA    (BIT(15))
#define SDIO_SLCHOST_FN1_SLC1HOST_TX_START_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC1HOST_TX_START_INT_ENA_V << SDIO_SLCHOST_FN1_SLC1HOST_TX_START_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC1HOST_TX_START_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC1HOST_TX_START_INT_ENA_S  15
/** SDIO_SLCHOST_FN1_SLC1_RX_UDF_INT_ENA : R/W; bitpos: [16]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC1_RX_UDF_INT_ENA    (BIT(16))
#define SDIO_SLCHOST_FN1_SLC1_RX_UDF_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC1_RX_UDF_INT_ENA_V << SDIO_SLCHOST_FN1_SLC1_RX_UDF_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC1_RX_UDF_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC1_RX_UDF_INT_ENA_S  16
/** SDIO_SLCHOST_FN1_SLC1_TX_OVF_INT_ENA : R/W; bitpos: [17]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC1_TX_OVF_INT_ENA    (BIT(17))
#define SDIO_SLCHOST_FN1_SLC1_TX_OVF_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC1_TX_OVF_INT_ENA_V << SDIO_SLCHOST_FN1_SLC1_TX_OVF_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC1_TX_OVF_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC1_TX_OVF_INT_ENA_S  17
/** SDIO_SLCHOST_FN1_SLC1_RX_PF_VALID_INT_ENA : R/W; bitpos: [18]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC1_RX_PF_VALID_INT_ENA    (BIT(18))
#define SDIO_SLCHOST_FN1_SLC1_RX_PF_VALID_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC1_RX_PF_VALID_INT_ENA_V << SDIO_SLCHOST_FN1_SLC1_RX_PF_VALID_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC1_RX_PF_VALID_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC1_RX_PF_VALID_INT_ENA_S  18
/** SDIO_SLCHOST_FN1_SLC1_EXT_BIT0_INT_ENA : R/W; bitpos: [19]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC1_EXT_BIT0_INT_ENA    (BIT(19))
#define SDIO_SLCHOST_FN1_SLC1_EXT_BIT0_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC1_EXT_BIT0_INT_ENA_V << SDIO_SLCHOST_FN1_SLC1_EXT_BIT0_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC1_EXT_BIT0_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC1_EXT_BIT0_INT_ENA_S  19
/** SDIO_SLCHOST_FN1_SLC1_EXT_BIT1_INT_ENA : R/W; bitpos: [20]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC1_EXT_BIT1_INT_ENA    (BIT(20))
#define SDIO_SLCHOST_FN1_SLC1_EXT_BIT1_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC1_EXT_BIT1_INT_ENA_V << SDIO_SLCHOST_FN1_SLC1_EXT_BIT1_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC1_EXT_BIT1_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC1_EXT_BIT1_INT_ENA_S  20
/** SDIO_SLCHOST_FN1_SLC1_EXT_BIT2_INT_ENA : R/W; bitpos: [21]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC1_EXT_BIT2_INT_ENA    (BIT(21))
#define SDIO_SLCHOST_FN1_SLC1_EXT_BIT2_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC1_EXT_BIT2_INT_ENA_V << SDIO_SLCHOST_FN1_SLC1_EXT_BIT2_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC1_EXT_BIT2_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC1_EXT_BIT2_INT_ENA_S  21
/** SDIO_SLCHOST_FN1_SLC1_EXT_BIT3_INT_ENA : R/W; bitpos: [22]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC1_EXT_BIT3_INT_ENA    (BIT(22))
#define SDIO_SLCHOST_FN1_SLC1_EXT_BIT3_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC1_EXT_BIT3_INT_ENA_V << SDIO_SLCHOST_FN1_SLC1_EXT_BIT3_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC1_EXT_BIT3_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC1_EXT_BIT3_INT_ENA_S  22
/** SDIO_SLCHOST_FN1_SLC1_WIFI_RX_NEW_PACKET_INT_ENA : R/W; bitpos: [23]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC1_WIFI_RX_NEW_PACKET_INT_ENA    (BIT(23))
#define SDIO_SLCHOST_FN1_SLC1_WIFI_RX_NEW_PACKET_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC1_WIFI_RX_NEW_PACKET_INT_ENA_V << SDIO_SLCHOST_FN1_SLC1_WIFI_RX_NEW_PACKET_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC1_WIFI_RX_NEW_PACKET_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC1_WIFI_RX_NEW_PACKET_INT_ENA_S  23
/** SDIO_SLCHOST_FN1_SLC1_HOST_RD_RETRY_INT_ENA : R/W; bitpos: [24]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC1_HOST_RD_RETRY_INT_ENA    (BIT(24))
#define SDIO_SLCHOST_FN1_SLC1_HOST_RD_RETRY_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC1_HOST_RD_RETRY_INT_ENA_V << SDIO_SLCHOST_FN1_SLC1_HOST_RD_RETRY_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC1_HOST_RD_RETRY_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC1_HOST_RD_RETRY_INT_ENA_S  24
/** SDIO_SLCHOST_FN1_SLC1_BT_RX_NEW_PACKET_INT_ENA : R/W; bitpos: [25]; default: 0;
 *  *******Description***********
 */
#define SDIO_SLCHOST_FN1_SLC1_BT_RX_NEW_PACKET_INT_ENA    (BIT(25))
#define SDIO_SLCHOST_FN1_SLC1_BT_RX_NEW_PACKET_INT_ENA_M  (SDIO_SLCHOST_FN1_SLC1_BT_RX_NEW_PACKET_INT_ENA_V << SDIO_SLCHOST_FN1_SLC1_BT_RX_NEW_PACKET_INT_ENA_S)
#define SDIO_SLCHOST_FN1_SLC1_BT_RX_NEW_PACKET_INT_ENA_V  0x00000001U
#define SDIO_SLCHOST_FN1_SLC1_BT_RX_NEW_PACKET_INT_ENA_S  25

